app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @users = User.find(params[:id])

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Mohit"], ["email", "test2@gmail.com"], ["password", "[FILTERED]"], ["created_at", "2023-12-21 10:12:56.071529"], ["updated_at", "2023-12-21 10:12:56.071529"]]
---
  def create
    @users = User.new(getParams)

    if @users.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "te@gmail.com"], ["updated_at", "2023-12-21 11:40:55.311964"], ["id", 3]]
---
  def update
    @users = User.find(params[:id])

    if @users.update(getParams)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @users = User.find(params[:id])
    @users.destroy